erp3l/src/Catalogs/Риски/Риски.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Риски</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Проекция</name>
    <type>
      <types>CatalogRef.Проекции</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>CatalogRef.Цели</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныВозникновения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Последствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВероятность</name>
    <type>
      <types>CatalogRef.СтепениРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>Ущерб</name>
    <type>
      <types>CatalogRef.КатегорииУщерба</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОснования</name>
    <type>
      <types>CatalogRef.ТипыОснованийРисковыхСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникРиска</name>
    <type>
      <types>CatalogRef.ИсточникиРисков</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитываетсяВНалоговомМониторинге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеРиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяНК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяНКПункт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяНКПодпункт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяНКАбзац</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньРиска</name>
    <type>
      <types>CatalogRef.УровниРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаПоследствий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторОКВЭД2</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьРиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вероятность</name>
    <type>
      <types>CatalogRef.ВероятностиРисков</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Enums/ВидыМероприятий/ВидыМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМероприятий</name>
  <enumValues>
    <name>КонтрольноеМероприятие</name>
  </enumValues>
  <enumValues>
    <name>Инициатива</name>
  </enumValues>
  <enumValues>
    <name>РеакцияНаРиск</name>
  </enumValues>
  <enumValues>
    <name>ЗакупочнаяПроцедура</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/ШаблоныМероприятий/ШаблоныМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныМероприятий</name>
  <predefined>
    <items>
      <name>ЗакупочнаяПроцедура_АукционМСП</name>
      <description>Шаблон Закупочная процедура (аукцион в электронной форме у МСП)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_Аукцион</name>
      <description>Шаблон Закупочная процедура (аукцион)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_ЗакупкаУЕдинственногоПоставщика</name>
      <description>Шаблон Закупочная процедура (закупка у единственного поставщика)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_ЗапросКотировокМСП</name>
      <description>Шаблон Закупочная процедура (запрос котировок в электронной форме у МСП)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_ЗапросКотировок</name>
      <description>Шаблон Закупочная процедура (запрос котировок)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_ЗапросПредложенийМСП</name>
      <description>Шаблон Закупочная процедура (запрос предложений в электронной форме у МСП)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_ЗапросПредложений</name>
      <description>Шаблон Закупочная процедура (запрос предложений)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_КвалификационныйОтбор</name>
      <description>Шаблон Закупочная процедура (квалификационный отбор)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_КонкурентныеПереговоры</name>
      <description>Шаблон Закупочная процедура (конкурентные переговоры)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_КонкурсМСП</name>
      <description>Шаблон Закупочная процедура (конкурс в электронной форме у МСП)</description>
    </items>
    <items>
      <name>ЗакупочнаяПроцедура_Конкурс</name>
      <description>Шаблон Закупочная процедура (конкурс)</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>EnumRef.ВидыМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроцентВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКонтрольЗатрат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыбораПоставщика</name>
    <type>
      <types>EnumRef.СпособыВыбораПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьПоследовательностьСтадий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводственныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИспользоватьПроизводственныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаПроведения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрольнойПроцедуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПроведения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеВыявленияРисков</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеПодразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяСистема</name>
    <type>
      <types>CatalogRef.ИнформационныеСистемыОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитываетсяВНалоговомМониторинге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждающиеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяЗаписьРезультатов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Стадии</name>
    <attributes>
      <name>Стадия</name>
      <type>
        <types>CatalogRef.СтадииМероприятий</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтогВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаРодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппирующаяСтрока</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеГруппы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОграничениеМинимальнойДлительности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОграничениеМаксимальнойДлительности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/Риски/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ОпределитьСостояниеОбъекта(ОбновитьОтветственныхВход = Ложь)
	ОбщийМодульДействияСогласованиеУХСервер = ОбщегоНазначения.ОбщийМодуль("ДействияСогласованиеУХСервер");
	Если ОбщийМодульДействияСогласованиеУХСервер <> Неопределено Тогда
		ОбщийМодульДействияСогласованиеУХСервер.ОпределитьСостояниеЗаявки(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбъектаПриИзменении_Подключаемый()
	НовоеЗначениеСтатуса = РеквизитСтатусОбъекта(ЭтаФорма);
	ПроверитьСохранениеИзменитьСтатус(НовоеЗначениеСтатуса);	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = РеквизитСтатусОбъекта(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьСохранениеИзменитьСтатус(ВыбранноеЗначение);
КонецПроцедуры

// Проверяет сохранение текущего объекта и изменяет его статус
// НовоеЗначениеСтатусаВход.
&НаКлиенте
Процедура ПроверитьСохранениеИзменитьСтатус(НовоеЗначениеСтатусаВход)
	Если (Объект.Ссылка.Пустая()) ИЛИ (ЭтаФорма.Модифицированность) Тогда
		СтруктураПараметров = Новый Структура("ВыбранноеЗначение", НовоеЗначениеСтатусаВход);
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", ЭтотОбъект, СтруктураПараметров);
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Изменение состояния возможно только после записи данных.
		|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	ИзменитьСостояниеЗаявкиКлиент(НовоеЗначениеСтатусаВход);	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = РеквизитСостояниеЗаявки(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;

	ПроверитьСохранениеИзменитьСтатус(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение)
	РасширениеПроцессыИСогласованиеКлиентУХ.ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбораПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать();
		ИзменитьСостояниеЗаявкиКлиент(Параметры.ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКСогласованию_Подключаемый() Экспорт
	РасширениеПроцессыИСогласованиеКлиентУХ.ПринятьКСогласованию(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласования_Подключаемый() Экспорт
	РасширениеПроцессыИСогласованиеКлиентУХ.ИсторияСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьДокумент_Подключаемый() Экспорт
	РасширениеПроцессыИСогласованиеКлиентУХ.СогласоватьДокумент(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСогласование_Подключаемый() Экспорт
	РасширениеПроцессыИСогласованиеКлиентУХ.ОтменитьСогласование(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласования_Подключаемый() Экспорт
	РасширениеПроцессыИСогласованиеКлиентУХ.МаршрутСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЭлементаОрганизации_Подключаемый(Элемент) Экспорт
	ОпределитьСостояниеОбъекта(Истина);		
	ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент);
КонецПроцедуры		// ПриИзмененииЭлементаОрганизации_Подключаемый()

// Возвращает значение реквизита СостояниеЗаявки на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСостояниеЗаявки(ФормаВход)
	Возврат ФормаВход["СостояниеЗаявки"];
КонецФункции

// Возвращает значение реквизита СтатусОбъекта на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСтатусОбъекта(ФормаВход)
	Возврат ФормаВход["СтатусОбъекта"];
КонецФункции

// Возвращает значение реквизита Согласующий на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСогласующий(ФормаВход)
	Возврат ФормаВход["Согласующий"];
КонецФункции

// Выполняет обработчик ПриИзменении, сопоставленный по умолчанию для элемента Элемент
&НаКлиенте
Процедура ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент)
	#Если НЕ ВебКлиент Тогда
	ИмяЭлемента = Элемент.Имя;
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
		Для Каждого ТекОбработчикиИзмененияОрганизации Из ЭтаФорма["ОбработчикиИзмененияОрганизации"] Цикл
			Если СокрЛП(ТекОбработчикиИзмененияОрганизации.ИмяРеквизита) = СокрЛП(ИмяЭлемента) Тогда
				СтрокаВыполнения = ТекОбработчикиИзмененияОрганизации.ИмяОбработчика + "(Элемент);";
				Выполнить СтрокаВыполнения;
			Иначе
				// Выполняем поиск далее.
			КонецЕсли; 
		КонецЦикла;	
	Иначе
		// Передан пустой элемент.
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры		// ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации()	

// Обновляет отображаемы данные на форме.
&НаСервере
Процедура ОбновитьДанныеФормы()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СписокМероприятий.Параметры.УстановитьЗначениеПараметра("Контекст", Объект.Ссылка);
		СписокШаблоныРеакцииНаИнцидент.Параметры.УстановитьЗначениеПараметра("Контекст", Объект.Ссылка); 
		СписокШаблоныПредупредительныхМер.Параметры.УстановитьЗначениеПараметра("Контекст", Объект.Ссылка); 
		НовыйОтбор = КонтрольныеПроцедуры.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контекст");
		НовыйОтбор.ПравоеЗначение = Объект.Ссылка;
		НовыйОтбор.Использование = Истина;
	Иначе
		СписокМероприятий.Параметры.УстановитьЗначениеПараметра("Контекст", Неопределено);
		СписокШаблоныРеакцииНаИнцидент.Параметры.УстановитьЗначениеПараметра("Контекст", Неопределено); 
		СписокШаблоныПредупредительныхМер.Параметры.УстановитьЗначениеПараметра("Контекст", Неопределено); 
	КонецЕсли;	
КонецПроцедуры		// ОбновитьДанныеФормы()

// Возвращает типа объекта конфигурации по типу основания рисквого события ТипОснованияВход.
// Когда получить не удалось - будет возвращено Неопределено.
&НаСервереБезКонтекста
Функция ВернутьТипОбъектаПоТипуОснования(ТипОснованияВход)
	РезультатФункции = Неопределено;
	Если ЗначениеЗаполнено(ТипОснованияВход) Тогда
		СправочникБД = ТипОснованияВход.ОбъектБдОснования;
		РезультатФункции = ОбщегоНазначенияСерверУХ.ВернутьТипПоСсылкеБД(СправочникБД);	
	Иначе
		РезультатФункции = Неопределено;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ВернутьТипОбъектаПоТипуОснования()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДанныеФормы();
	ЗаполнитьСпискиВыбораНМ();
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ДействияСогласованиеУХСервер");
		Модуль.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(ЭтаФорма);
	КонецЕсли;
	УправлениеДоступностью();
КонецПроцедуры

&НаСервере
Процедура УправлениеДоступностью()
	Элементы.НаправлениеРиска.Видимость = Объект.УчитываетсяВНалоговомМониторинге;
	Элементы.КодНалога.Видимость = Объект.УчитываетсяВНалоговомМониторинге;
	Элементы.ГруппаКодНалога.Видимость = Объект.УчитываетсяВНалоговомМониторинге;
//	Элементы.ОКВЭД.Доступность = Объект.УчитываетсяВНалоговомМониторинге;
	Элементы.Категория.Видимость = Объект.УчитываетсяВНалоговомМониторинге;
	Элементы.ГруппаОписаниеОКВЭД2.Видимость = Объект.УчитываетсяВНалоговомМониторинге;
	Элементы.ОбластьРиска.Видимость = Объект.УчитываетсяВНалоговомМониторинге;
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбъектСогласован" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "ОбъектОтклонен" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "МаршрутИнициализирован" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "СостояниеЗаявкиПриИзменении" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "ОбновитьСписокШаблоновМероприятий" Тогда
		Элементы.СписокШаблоныПредупредительныхМер.Обновить();
		Элементы.СписокШаблоныРеакцииНаИнцидент.Обновить();
		Элементы.КонтрольныеПроцедуры.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Ограничим выбор объектом БД из Типа основания.
	Если ЗначениеЗаполнено(Объект.ТипОснования) Тогда
		ТипОбъектаОснования = ВернутьТипОбъектаПоТипуОснования(Объект.ТипОснования);
		Если ТипОбъектаОснования <> Неопределено Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипОбъектаОснования);
			Элемент.ВыбиратьТип = Ложь;
			Элемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
		Иначе
			Элемент.ВыбиратьТип = Истина;
			Элемент.ОграничениеТипа = Новый ОписаниеТипов();
		КонецЕсли;
	Иначе
		Элемент.ВыбиратьТип = Истина;
		Элемент.ОграничениеТипа = Новый ОписаниеТипов();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КодОКВЭД2ПриИзменении(Элемент)
	Если НЕ ЭтоЕРПУХ() Тогда
		Объект.КодОКВЭД2 = СтрЗаменить(СокрЛП(Объект.КодОКВЭД2), ",", ".");
		ОКВЭД2 = ОбщегоНазначенияБПВызовСервера.ПолучитьКлассификатор("ОКВЭД2");
		Объект.НаименованиеОКВЭД2 = ОКВЭД2.Получить(Объект.КодОКВЭД2);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КодОКВЭД2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЭтоЕРПУХ() Тогда
		ВстраиваниеУХКлиент.НачалоВыбора_Организации(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма);
	Иначе
		СтандартнаяОбработка = Ложь;
		ВыбратьКодИзКлассификатора();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоЕРПУХ()
	Возврат ОбщегоНазначения.ПодсистемаСуществует("ИзмененныеОбъектыЕХ");
КонецФункции

&НаКлиенте
Процедура ВыбратьКодИзКлассификатора()
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипОбъекта",      "Справочник");
	ПараметрыФормы.Вставить("НазваниеОбъекта", "Организации");
	ПараметрыФормы.Вставить("НазваниеМакета",  "ОКВЭД2");
	ПараметрыФормы.Вставить("ТекущийПериод",   ТекущаяДата());
	ИмяРеквизитаКод = "КодОКВЭД2";
	ПараметрыФормы.Вставить("ТекущийКод",      Объект[ИмяРеквизитаКод]);
	//ПараметрыФормы.Вставить("Комментарий",     Комментарий);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяКлассификатора", "ОКВЭД2");
	ДополнительныеПараметры.Вставить("ИмяРеквизитаКод",   "КодОКВЭД2");
	ДополнительныеПараметры.Вставить("ИмяРеквизитаНаименование", "НаименованиеОКВЭД2");
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьКодИзКлассификатораЗавершение", 
		ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы,,,,, ОповещениеОЗакрытии);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКодИзКлассификатораЗавершение(РезультатЗакрытия, ДопПараметры) Экспорт
	
	ВыбранныйКод = РезультатЗакрытия;	
	
	Если ВыбранныйКод <> Неопределено Тогда
		
		Модифицированность = Истина;
		
		Объект[ДопПараметры.ИмяРеквизитаКод] = ВыбранныйКод;
		
		Объект[ДопПараметры.ИмяРеквизитаНаименование] = НаименованиеПоКлассификатору(
			ДопПараметры.ИмяКлассификатора, ВыбранныйКод);
			
		Если ДопПараметры.ИмяРеквизитаКод = "КодОКВЭД" Тогда
			ПодсказкаОКВЭД2 = "";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НаименованиеПоКлассификатору(Знач ИмяКлассификатора, Знач КодПоКлассификатору)

	Модуль = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияБПВызовСервера");
	Классификатор = Модуль.ПолучитьКлассификатор(ИмяКлассификатора);
	
	Возврат Классификатор.Получить(КодПоКлассификатору);

КонецФункции

&НаКлиенте
Процедура ЦельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Проекция) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Проекция", Объект.Проекция);
		ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
		Имя = "Справочник.Цели.ФормаВыбора";
		ОткрытьФорму(Имя, ПараметрыФормы, Элементы.Цель);
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьШаблонРеакцииНаРиск(Команда)
	ПараметрыФормы = Новый Структура;
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("ВидМероприятия", ПредопределенноеЗначение("Перечисление.ВидыМероприятий.РеакцияНаРиск"));
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", СтруктураЗаполнения);
	ПараметрыФормы.Вставить("Принадлежность", Объект.Ссылка);
	ОткрытьФорму("Справочник.ШаблоныМероприятий.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьШаблонПредупредительныхМер(Команда)
	ПараметрыФормы = Новый Структура;
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("ВидМероприятия", ПредопределенноеЗначение("Перечисление.ВидыМероприятий.КонтрольноеМероприятие"));
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", СтруктураЗаполнения);
	ПараметрыФормы.Вставить("Принадлежность", Объект.Ссылка);
	ОткрытьФорму("Справочник.ШаблоныМероприятий.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	#Если ВебКлиент Тогда
	ОпределитьСостояниеОбъекта(Истина);	
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	#Если ВебКлиент Тогда
	ОпределитьСостояниеОбъекта(Истина);	
	#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораНМ()
	НалоговыйМониторинг.ЗаполнитьСпискиВыбораВЭлементахУправления(Элементы.НаправлениеРиска, "РегламентированноеУведомлениеРискиОрганизацииНалоговыйМониторинг", "СпискиВыбора2020_1", "СписокНапрРиск");
	НалоговыйМониторинг.ЗаполнитьСпискиВыбораВЭлементахУправления(Элементы.КодНалога, "РегламентированноеУведомлениеРискиОрганизацииНалоговыйМониторинг", "СпискиВыбора2020_1", "СписокКодНалог");
	НалоговыйМониторинг.ЗаполнитьСпискиВыбораВЭлементахУправления(Элементы.Категория, "РегламентированноеУведомлениеРискиОрганизацииНалоговыйМониторинг", "СпискиВыбора2020_1", "СписокКатегорРиск");
	НалоговыйМониторинг.ЗаполнитьСпискиВыбораВЭлементахУправления(Элементы.ОбластьРиска, "РегламентированноеУведомлениеРискиОрганизацииНалоговыйМониторинг", "СпискиВыбора2020_1", "СписокОблРиск");
КонецПроцедуры

&НаКлиенте
Процедура УчитываетсяВНалоговомМониторингеПриИзменении(Элемент)
	УправлениеДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗначение(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ущерб) Тогда
		Объект.Ущерб = ПолучитьКатегорииУщерба(Объект.ОценкаПоследствий);
	КонецЕсли;
	УровеньИзБазы = ПолучитьДанныеУровняРиска(Объект.Вероятность, Объект.Ущерб);
	Если ЗначениеЗаполнено(УровеньИзБазы) Тогда
		Объект.УровеньРиска = УровеньИзБазы;
	ИначеЕсли Команда <> Неопределено Тогда
		Сообщить(НСтр("ru = 'Для выбранной комбинации вероятности и ущерба уровень риска не задан'"));
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКатегорииУщерба(Ущерб)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КатегорииУщерба.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КатегорииУщерба КАК КатегорииУщерба
		|ГДЕ
		|	КатегорииУщерба.МинимальныйУщерб <= &Ущерб
		|	И КатегорииУщерба.МаксимальныйУщерб >= &Ущерб
		|	И КатегорииУщерба.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ущерб", Ущерб);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецФункции
	
&НаСервереБезКонтекста
Функция ПолучитьДанныеУровняРиска(Вероятность, Ущерб)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаУровняРиска.УровеньРиска КАК УровеньРиска
		|ИЗ
		|	РегистрСведений.УстановкаУровняРиска КАК УстановкаУровняРиска
		|ГДЕ
		|	УстановкаУровняРиска.Вероятность = &Вероятность
		|	И УстановкаУровняРиска.Ущерб = &Ущерб";
	
	Запрос.УстановитьПараметр("Вероятность", Вероятность);
	Запрос.УстановитьПараметр("Ущерб", Ущерб);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.УровеньРиска;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура УщербПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Ущерб) И ЗначениеЗаполнено(Объект.Вероятность) И НЕ ЗначениеЗаполнено(Объект.УровеньРиска) Тогда
		ОбновитьЗначение(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВероятностьПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Ущерб) И ЗначениеЗаполнено(Объект.Вероятность) И НЕ ЗначениеЗаполнено(Объект.УровеньРиска) Тогда
		ОбновитьЗначение(Неопределено);
	КонецЕсли;
КонецПроцедуры

//Обязательный обработчик событий EPR
&НаКлиенте
Процедура ПродолжитьВыполнениеКомандыЛокализации(ИмяКоманды, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры
